{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "conv1d_1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 400, 1], "dtype": "float32", "sparse": false, "name": "conv1d_1_input"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000sp\u0000\u0000\u0000t\u0000j\u0001|\u0000\u0083\u0001}\u0003t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0004t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000d\u0002\u0014\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0005|\u0005|\u0001\u0014\u0000}\u0006t\u0000j\u0003|\u0000|\u0006|\u0004\u0083\u0003S\u0000)\u0004N\u00e9\u0001\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0004axis)\u0004\u00da\u0002tf\u00da\u0005shape\u00da\u0006concat\u00da\u0005slice)\u0007\u00da\u0004data\u00da\u0003idx\u00da\u0005partsr\u0005\u0000\u0000\u0000\u00da\u0004size\u00da\u0006stride\u00da\u0005start\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\fcon_pick2.py\u00da\tget_slice.\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\n\u0001&\u0001*\u0001\b\u0001", null, null], "function_type": "lambda", "output_shape": [400, 1], "output_shape_type": "raw", "arguments": {"idx": 0, "parts": 3}}, "inbound_nodes": [[["conv1d_1_input", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000sp\u0000\u0000\u0000t\u0000j\u0001|\u0000\u0083\u0001}\u0003t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0004t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000d\u0002\u0014\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0005|\u0005|\u0001\u0014\u0000}\u0006t\u0000j\u0003|\u0000|\u0006|\u0004\u0083\u0003S\u0000)\u0004N\u00e9\u0001\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0004axis)\u0004\u00da\u0002tf\u00da\u0005shape\u00da\u0006concat\u00da\u0005slice)\u0007\u00da\u0004data\u00da\u0003idx\u00da\u0005partsr\u0005\u0000\u0000\u0000\u00da\u0004size\u00da\u0006stride\u00da\u0005start\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\fcon_pick2.py\u00da\tget_slice.\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\n\u0001&\u0001*\u0001\b\u0001", null, null], "function_type": "lambda", "output_shape": [400, 1], "output_shape_type": "raw", "arguments": {"idx": 1, "parts": 3}}, "inbound_nodes": [[["conv1d_1_input", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["\u00e3\u0003\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000sp\u0000\u0000\u0000t\u0000j\u0001|\u0000\u0083\u0001}\u0003t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0004t\u0000j\u0002|\u0003d\u0000d\u0001\u0085\u0002\u0019\u0000|\u0002\u001a\u0000|\u0003d\u0001d\u0000\u0085\u0002\u0019\u0000d\u0002\u0014\u0000g\u0002d\u0002d\u0003\u008d\u0002}\u0005|\u0005|\u0001\u0014\u0000}\u0006t\u0000j\u0003|\u0000|\u0006|\u0004\u0083\u0003S\u0000)\u0004N\u00e9\u0001\u0000\u0000\u0000\u00e9\u0000\u0000\u0000\u0000)\u0001\u00da\u0004axis)\u0004\u00da\u0002tf\u00da\u0005shape\u00da\u0006concat\u00da\u0005slice)\u0007\u00da\u0004data\u00da\u0003idx\u00da\u0005partsr\u0005\u0000\u0000\u0000\u00da\u0004size\u00da\u0006stride\u00da\u0005start\u00a9\u0000r\u000e\u0000\u0000\u0000\u00fa\fcon_pick2.py\u00da\tget_slice.\u0000\u0000\u0000s\n\u0000\u0000\u0000\u0000\u0001\n\u0001&\u0001*\u0001\b\u0001", null, null], "function_type": "lambda", "output_shape": [400, 1], "output_shape_type": "raw", "arguments": {"idx": 2, "parts": 3}}, "inbound_nodes": [[["conv1d_1_input", 0, 0, {}]]]}, {"name": "sequential_1", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "batch_input_shape": [null, 400, 1], "dtype": "float32", "filters": 32, "kernel_size": [21], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 64, "kernel_size": [15], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 128, "kernel_size": [11], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 0}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}], ["sequential_1", 3, 0, {}]]]}], "input_layers": [["conv1d_1_input", 0, 0]], "output_layers": [["concatenate_1", 0, 0]]}, "keras_version": "2.0.6", "backend": "tensorflow"}